<a href="https://colab.research.google.com/github/virf96/Chat-Bot/blob/master/titanic_set.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
 
# bajar el set de datos desde openML
data = pd.read_csv('https://www.openml.org/data/get_csv/16826755/phpMYEkMl')
 
# reemplazar ? con np.nan
data = data.replace('?', np.nan)
 
# capturar solo la primer cabina cuando hay mas de una en la variable
def get_first_cabin(row):
    try:
        return row.split()[0]
    except:
        return np.nan
 
data['cabin'] = data['cabin'].apply(get_first_cabin)
 
# guardar los datos en csv
data.to_csv('titanic.csv', index=False)

In [2]:
data.head()

   pclass  survived  ... body                        home.dest
0       1         1  ...  NaN                     St Louis, MO
1       1         1  ...  NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...  NaN  Montreal, PQ / Chesterville, ON
3       1         0  ...  135  Montreal, PQ / Chesterville, ON
4       1         0  ...  NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]